OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic10f320.h
/*
 * This declarations of the PIC10F320 MCU.
 *
 * This file is part of the GNU PIC library for SDCC, originally
 * created by Molnar Karoly <molnarkaroly@users.sf.net> 2016.
 *
 * This file is generated automatically by the cinc2h.pl, 2016-04-13 17:22:54 UTC.
 *
 * SDCC is licensed under the GNU Public license (GPL) v2. Note that
 * this license covers the code to the compiler and other executables,
 * but explicitly does not cover any code or objects generated by sdcc.
 *
 * For pic device libraries and header files which are derived from
 * Microchip header (.inc) and linker script (.lkr) files Microchip
 * requires that "The header files should state that they are only to be
 * used with authentic Microchip devices" which makes them incompatible
 * with the GPL. Pic device libraries and header files are located at
 * non-free/lib and non-free/include directories respectively.
 * Sdcc should be run with the --use-non-free command line option in
 * order to include non-free header files and libraries.
 *
 * See http://sdcc.sourceforge.net/ for the latest information on sdcc.
 */

#ifndef __PIC10F320_H__
#define __PIC10F320_H__

//==============================================================================
//
//	Register Addresses
//
//==============================================================================

#ifndef NO_ADDR_DEFINES

#define INDF_ADDR               0x0000
#define TMR0_ADDR               0x0001
#define PCL_ADDR                0x0002
#define STATUS_ADDR             0x0003
#define FSR_ADDR                0x0004
#define PORTA_ADDR              0x0005
#define TRISA_ADDR              0x0006
#define LATA_ADDR               0x0007
#define ANSELA_ADDR             0x0008
#define WPUA_ADDR               0x0009
#define PCLATH_ADDR             0x000A
#define INTCON_ADDR             0x000B
#define PIR1_ADDR               0x000C
#define PIE1_ADDR               0x000D
#define OPTION_REG_ADDR         0x000E
#define PCON_ADDR               0x000F
#define OSCCON_ADDR             0x0010
#define TMR2_ADDR               0x0011
#define PR2_ADDR                0x0012
#define T2CON_ADDR              0x0013
#define PWM1DCL_ADDR            0x0014
#define PWM1DCH_ADDR            0x0015
#define PWM1CON_ADDR            0x0016
#define PWM1CON0_ADDR           0x0016
#define PWM2DCL_ADDR            0x0017
#define PWM2DCH_ADDR            0x0018
#define PWM2CON_ADDR            0x0019
#define PWM2CON0_ADDR           0x0019
#define IOCAP_ADDR              0x001A
#define IOCAN_ADDR              0x001B
#define IOCAF_ADDR              0x001C
#define FVRCON_ADDR             0x001D
#define ADRES_ADDR              0x001E
#define ADCON_ADDR              0x001F
#define PMADR_ADDR              0x0020
#define PMADRL_ADDR             0x0020
#define PMADRH_ADDR             0x0021
#define PMDAT_ADDR              0x0022
#define PMDATL_ADDR             0x0022
#define PMDATH_ADDR             0x0023
#define PMCON1_ADDR             0x0024
#define PMCON2_ADDR             0x0025
#define CLKRCON_ADDR            0x0026
#define NCO1ACC_ADDR            0x0027
#define NCO1ACCL_ADDR           0x0027
#define NCO1ACCH_ADDR           0x0028
#define NCO1ACCU_ADDR           0x0029
#define NCO1INC_ADDR            0x002A
#define NCO1INCL_ADDR           0x002A
#define NCO1INCH_ADDR           0x002B
#define NCO1INCU_ADDR           0x002C
#define NCO1CON_ADDR            0x002D
#define NCO1CLK_ADDR            0x002E
#define WDTCON_ADDR             0x0030
#define CLC1CON_ADDR            0x0031
#define CLC1SEL0_ADDR           0x0032
#define CLC1SEL1_ADDR           0x0033
#define CLC1POL_ADDR            0x0034
#define CLC1GLS0_ADDR           0x0035
#define CLC1GLS1_ADDR           0x0036
#define CLC1GLS2_ADDR           0x0037
#define CLC1GLS3_ADDR           0x0038
#define CWG1CON0_ADDR           0x0039
#define CWG1CON1_ADDR           0x003A
#define CWG1CON2_ADDR           0x003B
#define CWG1DBR_ADDR            0x003C
#define CWG1DBF_ADDR            0x003D
#define VREGCON_ADDR            0x003E
#define BORCON_ADDR             0x003F

#endif // #ifndef NO_ADDR_DEFINES

//==============================================================================
//
//	Register Definitions
//
//==============================================================================

extern __at(0x0000) __sfr INDF;
extern __at(0x0001) __sfr TMR0;
extern __at(0x0002) __sfr PCL;

//==============================================================================
//        STATUS Bits

extern __at(0x0003) __sfr STATUS;

typedef union
  {
  struct
    {
    unsigned C                  : 1;
    unsigned DC                 : 1;
    unsigned Z                  : 1;
    unsigned NOT_PD             : 1;
    unsigned NOT_TO             : 1;
    unsigned RP0                : 1;
    unsigned RP1                : 1;
    unsigned IRP                : 1;
    };

  struct
    {
    unsigned                    : 5;
    unsigned RP                 : 2;
    unsigned                    : 1;
    };
  } __STATUSbits_t;

extern __at(0x0003) volatile __STATUSbits_t STATUSbits;

#define _C                      0x01
#define _DC                     0x02
#define _Z                      0x04
#define _NOT_PD                 0x08
#define _NOT_TO                 0x10
#define _RP0                    0x20
#define _RP1                    0x40
#define _IRP                    0x80

//==============================================================================

extern __at(0x0004) __sfr FSR;

//==============================================================================
//        PORTA Bits

extern __at(0x0005) __sfr PORTA;

typedef union
  {
  struct
    {
    unsigned RA0                : 1;
    unsigned RA1                : 1;
    unsigned RA2                : 1;
    unsigned RA3                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RA                 : 4;
    unsigned                    : 4;
    };
  } __PORTAbits_t;

